using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Zadachi
{

    //Списки отличаются от массивов тем, что доступ к их элементам осуществляется последовательно, в то время
    //как массивы – структура данных произвольного доступа (предоставляет возможность в любой момент времени
    //обратиться к любому элементу по его индексу).


    //Функция - подпрограмма, выполняющая какие-либо операции и возвращающая значение.
    //Процедура - подпрограмма, которая только выполняет операции, без возврата значения.
    //Метод - это функция или процедура, которая принадлежит классу или экземпляру класса.

}
